module @module {
  util.global private @__auto.constant_64_64_3_3_torch.float32 = dense_resource<__auto.constant_64_64_3_3_torch.float32> : tensor<64x64x3x3xf32>
  util.global private mutable @__auto.constant__torch.int64 = dense_resource<__auto.constant__torch.int64> : tensor<i64>
  util.global private mutable @__auto.constant_64_torch.float32 = dense_resource<__auto.constant_64_torch.float32> : tensor<64xf32>
  util.global private mutable @__auto.constant_64_torch.float32$1 = dense_resource<__auto.constant_64_torch.float32$1> : tensor<64xf32>
  func.func @main(%arg0: !torch.vtensor<[1,64,56,56],f32>) -> !torch.vtensor<[1,64,56,56],f32> attributes {torch.assume_strict_symbolic_shapes} {
    %__auto.constant_64_64_3_3_torch.float32 = util.global.load @__auto.constant_64_64_3_3_torch.float32 : tensor<64x64x3x3xf32>
    %0 = torch_c.from_builtin_tensor %__auto.constant_64_64_3_3_torch.float32 : tensor<64x64x3x3xf32> -> !torch.vtensor<[64,64,3,3],f32>
    %none = torch.constant.none
    %int1 = torch.constant.int 1
    %int1_0 = torch.constant.int 1
    %1 = torch.prim.ListConstruct %int1, %int1_0 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_1 = torch.constant.int 1
    %int1_2 = torch.constant.int 1
    %2 = torch.prim.ListConstruct %int1_1, %int1_2 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_3 = torch.constant.int 1
    %int1_4 = torch.constant.int 1
    %3 = torch.prim.ListConstruct %int1_3, %int1_4 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_5 = torch.constant.int 1
    %4 = torch.aten.conv2d %arg0, %0, %none, %1, %2, %3, %int1_5 : !torch.vtensor<[1,64,56,56],f32>, !torch.vtensor<[64,64,3,3],f32>, !torch.none, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.int -> !torch.vtensor<[1,64,56,56],f32>
    %__auto.constant__torch.int64 = util.global.load @__auto.constant__torch.int64 : tensor<i64>
    %5 = torch_c.from_builtin_tensor %__auto.constant__torch.int64 : tensor<i64> -> !torch.vtensor<[],si64>
    %int1_6 = torch.constant.int 1
    %int1_7 = torch.constant.int 1
    %6 = torch.aten.add.Scalar %5, %int1_6, %int1_7 : !torch.vtensor<[],si64>, !torch.int, !torch.int -> !torch.vtensor<[],si64>
    %7 = torch_c.to_builtin_tensor %6 : !torch.vtensor<[],si64> -> tensor<i64>
    util.global.store %7, @__auto.constant__torch.int64 : tensor<i64>
    %int0 = torch.constant.int 0
    %int2 = torch.constant.int 2
    %int3 = torch.constant.int 3
    %8 = torch.prim.ListConstruct %int0, %int2, %int3 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %int0_8 = torch.constant.int 0
    %true = torch.constant.bool true
    %result0, %result1 = torch.aten.var_mean.correction %4, %8, %int0_8, %true : !torch.vtensor<[1,64,56,56],f32>, !torch.list<int>, !torch.int, !torch.bool -> !torch.vtensor<[1,64,1,1],f32>, !torch.vtensor<[1,64,1,1],f32>
    %float1.000000e-05 = torch.constant.float 1.000000e-05
    %int1_9 = torch.constant.int 1
    %9 = torch.aten.add.Scalar %result0, %float1.000000e-05, %int1_9 : !torch.vtensor<[1,64,1,1],f32>, !torch.float, !torch.int -> !torch.vtensor<[1,64,1,1],f32>
    %10 = torch.aten.rsqrt %9 : !torch.vtensor<[1,64,1,1],f32> -> !torch.vtensor<[1,64,1,1],f32>
    %int1_10 = torch.constant.int 1
    %11 = torch.aten.sub.Tensor %4, %result1, %int1_10 : !torch.vtensor<[1,64,56,56],f32>, !torch.vtensor<[1,64,1,1],f32>, !torch.int -> !torch.vtensor<[1,64,56,56],f32>
    %12 = torch.aten.mul.Tensor %11, %10 : !torch.vtensor<[1,64,56,56],f32>, !torch.vtensor<[1,64,1,1],f32> -> !torch.vtensor<[1,64,56,56],f32>
    %int3_11 = torch.constant.int 3
    %13 = torch.prim.ListConstruct %int3_11 : (!torch.int) -> !torch.list<int>
    %14 = torch.prims.squeeze %result1, %13 : !torch.vtensor<[1,64,1,1],f32>, !torch.list<int> -> !torch.vtensor<[1,64,1],f32>
    %int2_12 = torch.constant.int 2
    %15 = torch.prim.ListConstruct %int2_12 : (!torch.int) -> !torch.list<int>
    %16 = torch.prims.squeeze %14, %15 : !torch.vtensor<[1,64,1],f32>, !torch.list<int> -> !torch.vtensor<[1,64],f32>
    %int0_13 = torch.constant.int 0
    %17 = torch.prim.ListConstruct %int0_13 : (!torch.int) -> !torch.list<int>
    %18 = torch.prims.squeeze %16, %17 : !torch.vtensor<[1,64],f32>, !torch.list<int> -> !torch.vtensor<[64],f32>
    %float1.000000e-01 = torch.constant.float 1.000000e-01
    %19 = torch.aten.mul.Scalar %18, %float1.000000e-01 : !torch.vtensor<[64],f32>, !torch.float -> !torch.vtensor<[64],f32>
    %__auto.constant_64_torch.float32 = util.global.load @__auto.constant_64_torch.float32 : tensor<64xf32>
    %20 = torch_c.from_builtin_tensor %__auto.constant_64_torch.float32 : tensor<64xf32> -> !torch.vtensor<[64],f32>
    %float9.000000e-01 = torch.constant.float 9.000000e-01
    %21 = torch.aten.mul.Scalar %20, %float9.000000e-01 : !torch.vtensor<[64],f32>, !torch.float -> !torch.vtensor<[64],f32>
    %int1_14 = torch.constant.int 1
    %22 = torch.aten.add.Tensor %19, %21, %int1_14 : !torch.vtensor<[64],f32>, !torch.vtensor<[64],f32>, !torch.int -> !torch.vtensor<[64],f32>
    %23 = torch_c.to_builtin_tensor %22 : !torch.vtensor<[64],f32> -> tensor<64xf32>
    util.global.store %23, @__auto.constant_64_torch.float32 : tensor<64xf32>
    %int3_15 = torch.constant.int 3
    %24 = torch.prim.ListConstruct %int3_15 : (!torch.int) -> !torch.list<int>
    %25 = torch.prims.squeeze %result0, %24 : !torch.vtensor<[1,64,1,1],f32>, !torch.list<int> -> !torch.vtensor<[1,64,1],f32>
    %int2_16 = torch.constant.int 2
    %26 = torch.prim.ListConstruct %int2_16 : (!torch.int) -> !torch.list<int>
    %27 = torch.prims.squeeze %25, %26 : !torch.vtensor<[1,64,1],f32>, !torch.list<int> -> !torch.vtensor<[1,64],f32>
    %int0_17 = torch.constant.int 0
    %28 = torch.prim.ListConstruct %int0_17 : (!torch.int) -> !torch.list<int>
    %29 = torch.prims.squeeze %27, %28 : !torch.vtensor<[1,64],f32>, !torch.list<int> -> !torch.vtensor<[64],f32>
    %float1.000320e00 = torch.constant.float 1.0003189792663476
    %30 = torch.aten.mul.Scalar %29, %float1.000320e00 : !torch.vtensor<[64],f32>, !torch.float -> !torch.vtensor<[64],f32>
    %float1.000000e-01_18 = torch.constant.float 1.000000e-01
    %31 = torch.aten.mul.Scalar %30, %float1.000000e-01_18 : !torch.vtensor<[64],f32>, !torch.float -> !torch.vtensor<[64],f32>
    %__auto.constant_64_torch.float32$1 = util.global.load @__auto.constant_64_torch.float32$1 : tensor<64xf32>
    %32 = torch_c.from_builtin_tensor %__auto.constant_64_torch.float32$1 : tensor<64xf32> -> !torch.vtensor<[64],f32>
    %float9.000000e-01_19 = torch.constant.float 9.000000e-01
    %33 = torch.aten.mul.Scalar %32, %float9.000000e-01_19 : !torch.vtensor<[64],f32>, !torch.float -> !torch.vtensor<[64],f32>
    %int1_20 = torch.constant.int 1
    %34 = torch.aten.add.Tensor %31, %33, %int1_20 : !torch.vtensor<[64],f32>, !torch.vtensor<[64],f32>, !torch.int -> !torch.vtensor<[64],f32>
    %35 = torch_c.to_builtin_tensor %34 : !torch.vtensor<[64],f32> -> tensor<64xf32>
    util.global.store %35, @__auto.constant_64_torch.float32$1 : tensor<64xf32>
    %36 = torch.vtensor.literal(dense_resource<torch_tensor_64_torch.float32> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %int-1 = torch.constant.int -1
    %37 = torch.aten.unsqueeze %36, %int-1 : !torch.vtensor<[64],f32>, !torch.int -> !torch.vtensor<[64,1],f32>
    %int-1_21 = torch.constant.int -1
    %38 = torch.aten.unsqueeze %37, %int-1_21 : !torch.vtensor<[64,1],f32>, !torch.int -> !torch.vtensor<[64,1,1],f32>
    %39 = torch.aten.mul.Tensor %12, %38 : !torch.vtensor<[1,64,56,56],f32>, !torch.vtensor<[64,1,1],f32> -> !torch.vtensor<[1,64,56,56],f32>
    %40 = torch.vtensor.literal(dense_resource<torch_tensor_64_torch.float32_1> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %int-1_22 = torch.constant.int -1
    %41 = torch.aten.unsqueeze %40, %int-1_22 : !torch.vtensor<[64],f32>, !torch.int -> !torch.vtensor<[64,1],f32>
    %int-1_23 = torch.constant.int -1
    %42 = torch.aten.unsqueeze %41, %int-1_23 : !torch.vtensor<[64,1],f32>, !torch.int -> !torch.vtensor<[64,1,1],f32>
    %int1_24 = torch.constant.int 1
    %43 = torch.aten.add.Tensor %39, %42, %int1_24 : !torch.vtensor<[1,64,56,56],f32>, !torch.vtensor<[64,1,1],f32>, !torch.int -> !torch.vtensor<[1,64,56,56],f32>
    %44 = torch.aten.relu %43 : !torch.vtensor<[1,64,56,56],f32> -> !torch.vtensor<[1,64,56,56],f32>
    return %44 : !torch.vtensor<[1,64,56,56],f32>
  }
}

{-#
  dialect_resources: {
    builtin: {
      __auto.constant_64_64_3_3_torch.float32: 