module @module {
  util.global private @__auto.constant_512_512_torch.float32 = dense_resource<__auto.constant_512_512_torch.float32> : tensor<512x512xf32>
  func.func @main(%arg0: !torch.vtensor<[1,512],f32>) -> !torch.vtensor<[1,512],f32> attributes {torch.assume_strict_symbolic_shapes} {
    %__auto.constant_512_512_torch.float32 = util.global.load @__auto.constant_512_512_torch.float32 : tensor<512x512xf32>
    %0 = torch_c.from_builtin_tensor %__auto.constant_512_512_torch.float32 : tensor<512x512xf32> -> !torch.vtensor<[512,512],f32>
    %1 = torch.vtensor.literal(dense_resource<torch_tensor_512_torch.float32> : tensor<512xf32>) : !torch.vtensor<[512],f32>
    %2 = torch.aten.linear %arg0, %0, %1 : !torch.vtensor<[1,512],f32>, !torch.vtensor<[512,512],f32>, !torch.vtensor<[512],f32> -> !torch.vtensor<[1,512],f32>
    %3 = torch.aten.relu %2 : !torch.vtensor<[1,512],f32> -> !torch.vtensor<[1,512],f32>
    return %3 : !torch.vtensor<[1,512],f32>
  }
}

{-#
  dialect_resources: {
    builtin: {
      __auto.constant_512_512_torch.float32: 