module @module {
  func.func @main(%arg0: !torch.vtensor<[1,32,56,56],f32>) -> !torch.vtensor<[1,16,56,56],f32> attributes {torch.assume_strict_symbolic_shapes} {
    %0 = torch.vtensor.literal(dense_resource<torch_tensor_32_1_3_3_torch.float32> : tensor<32x1x3x3xf32>) : !torch.vtensor<[32,1,3,3],f32>
    %none = torch.constant.none
    %int1 = torch.constant.int 1
    %int1_0 = torch.constant.int 1
    %1 = torch.prim.ListConstruct %int1, %int1_0 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_1 = torch.constant.int 1
    %int1_2 = torch.constant.int 1
    %2 = torch.prim.ListConstruct %int1_1, %int1_2 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_3 = torch.constant.int 1
    %int1_4 = torch.constant.int 1
    %3 = torch.prim.ListConstruct %int1_3, %int1_4 : (!torch.int, !torch.int) -> !torch.list<int>
    %int32 = torch.constant.int 32
    %4 = torch.aten.conv2d %arg0, %0, %none, %1, %2, %3, %int32 : !torch.vtensor<[1,32,56,56],f32>, !torch.vtensor<[32,1,3,3],f32>, !torch.none, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.int -> !torch.vtensor<[1,32,56,56],f32>
    %5 = torch.aten.relu6 %4 : !torch.vtensor<[1,32,56,56],f32> -> !torch.vtensor<[1,32,56,56],f32>
    %6 = torch.vtensor.literal(dense_resource<torch_tensor_16_32_1_1_torch.float32> : tensor<16x32x1x1xf32>) : !torch.vtensor<[16,32,1,1],f32>
    %none_5 = torch.constant.none
    %int1_6 = torch.constant.int 1
    %int1_7 = torch.constant.int 1
    %7 = torch.prim.ListConstruct %int1_6, %int1_7 : (!torch.int, !torch.int) -> !torch.list<int>
    %int0 = torch.constant.int 0
    %int0_8 = torch.constant.int 0
    %8 = torch.prim.ListConstruct %int0, %int0_8 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_9 = torch.constant.int 1
    %int1_10 = torch.constant.int 1
    %9 = torch.prim.ListConstruct %int1_9, %int1_10 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_11 = torch.constant.int 1
    %10 = torch.aten.conv2d %5, %6, %none_5, %7, %8, %9, %int1_11 : !torch.vtensor<[1,32,56,56],f32>, !torch.vtensor<[16,32,1,1],f32>, !torch.none, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.int -> !torch.vtensor<[1,16,56,56],f32>
    return %10 : !torch.vtensor<[1,16,56,56],f32>
  }
}

{-#
  dialect_resources: {
    builtin: {
      torch_tensor_32_1_3_3_torch.float32: "0x040000009B3C9FBE80C4003D5B4141BE00A024BA7E7E7DBE1EC79BBE56163BBEBBFF053E1330A03EEB573FBD282F093ED35C3ABEE6BE5DBE98B00A3E004C68BCAEC942BE72C59F3EFBEA8BBD4BE4A7BE00A7A23D0C9C9DBED37B7A3E70F682BE0E89A0BE86DB86BE10DD78BE40ACF5BD283D5DBEF00141BE1BEF633EA08B00BD7BBC6CBE2BCCE93CC06DBD3D24459FBEE6C76E3E7E06623EAE9B3B3E92A393BE9640C13C04A5A63E3B29933E9B5C5A3E0EAF65BE3073A93D2063103D1852483EA814273E26EEAB3D101B38BEF63076BDD0C80ABE0F79903E8BE48E3D3ED11A3E560691BD96AA843C63C59E3EE4D28D3E20AA4E3ED840A53EAE34223EA0F9DEBD9B018A3E76D1203DBF848DBE0B131D3E40B6C43C4A5BA3BE1B0DA23E9E9A8DBE4EF096BE4E9B343E00C9023C6B9AFB3DE8B89C3E80071F3EA75F873EBB3021BEEEE37C3E9321293EA21B923E50D9F43D8C5C8E3E629E84BEE05A1DBE03278E3E56FB1E3E66EE113EE6A30A3E704E45BE6652773E6BC5253EFEE966BE2A3C91BEBBEA9B3EDB5683BEB83D583E10910E3E5BF0BA3D5BA7DB3D16BAA4BEA8256B3EC8AA2FBED65D15BDBBD91A3E6B14523E40C1E3BC56CC08BCABC305BC8C7D803EF0FA56BEC3B1623E9B4C273ED8246C3EAB2D10BDD6F509BE93CB35BE50872C3E123A8DBE934A2A3EE06556BEAB01D23D76E7ACBD2B671F3CDE386ABE60E5443DC41C91BEC0866FBD262CE5BDF34D5C3E4045A4BC56D234BC4BDB85BE403AF0BDB4C29EBE266BF63D229C963E1B91EDBD2B0BD4BC50DE193E00C20CBD0720A03ED35A6E3E6B6BA83DBC1990BE30C1A83E286F153EDB6C8B3D48C2863EB0CDD1BDD8D7653EABFBFC3D9BF2CB3D6B52D93CE4DCA03E88F3933E82619DBE82EB8ABED6E01FBC4055523EDB4D3B3E6083013E94349D3EA0ABCDBD23DF42BE3F7F82BEF6AEBC3D0450A7BE563206BDE80968BE560BD7BD085B32BEDB1B08BE573FA43EE3F0703ED7CB873EA3E209BEE03CA43DC00EC6BC7A0583BE762222BE3E438C3EC4908BBE4BCAA4BD7610443D00178A3CA67B923D565653BCABB45FBD033C703E808FCABD83708CBE38DD05BECE2F02BE161F64BEFB8B6BBE9E914DBE4BA5903E5B911EBE664C86BE80DB4F3D0615C93DABF4C13B639C553E3BB5563E6E8F7EBEEE057EBE931A373E1BC9AABD96109D3EB73688BEE72187BEABB04B3CC0E0E7BD064261BE602128BE6063423ED66BD73C50F8AFBD30190DBE6BF3D3BC306E4CBECECA66BE70EF8C3DF8582B3E20227DBE4F6185BEF7F59F3E760F5FBDAB5FBF3D3BE3573EA03BCF3DD07D483ED62E84BDCB599FBEAB85983BC68987BD601B4A3E36AB1FBD9047BA3D300333BE90609B3D80CFB23C4BF8393EE3EC4B3EB6CE7ABD167249BE8BA30BBDC364413ED8A739BE90D5CBBD2B9C5BBEB0DACCBDE021733D28123C3EEF89A9BEF0EE413E56C0063D3B4428BE6078103E00BC59BC1B828FBEF2E1993ED6AC8CBCA062C3BD6A22A9BE0B126ABE6FCAA53ED632153D78EF61BEB028023EA0023ABD1698923C5742853E50F9AF3D7B0AE13D9F76A3BE3BB4DDBDE32455BEA0240FBEC86E0B3E538B58BEF675303ECAC0A3BE96CAD9BC40D5EA3DB75C973E",
      torch_tensor_16_32_1_1_torch.float32: "0x04000000551D073EF3D289BD9FA320BEA459B43DFC6D053E1AA5FEBD09CF833DAD178DBDC234803D83867BBD7CB412BEF07CA83D10DF1DBE688DBCBC1B6C7B3D2235FABC878E7CBDDF66303EF1440BBD97AB0D3EE54C2DBD915C173C90D9F33D1EB5C83C0B28D63DC5411F3ED7B426BEA048F1BD3F7C903D0C96F73BD0F29E3C162A083D0112EF3DA63207BE48A40CBEB78E253EF10B1EBDEBD454BD31D0B2BDF8DD2CBEA23E1B3EEECE2BBE21ABF2BDDCAF14BE046AB03DB0470EBDBD2C2E3A5EEEF33D4FC4333E09A3FABD60D5093E991E0B3EABD20A3E41F1FD3DFEF0E9BDF85A753CE9310F3E46F3403D3A831D3D8B75F03DA4BC17BE1F08953C387E91BD9EC9863C373534BE728DE3BDC4D39A3CC0310BBE4818E2BD10160C3E01E70F3E7DC74B3D62BB2E3EA71731BEFC8E143DE0E9633DE87217BD2C9AE33DCEE3DA3D2DA359BD595E09BE82AD523C39BCEC3C18CD1DBE3F2915BD6090C53DEDD38ABDAF029CBD1182BDBC5CFF8C3D05A8193D6340223E8E96193EE5E6133D14739CBD02B0DE3BE29018BEE00AD4BDE533B3BD7BC337BDEBC2093E8ACA0B3EBE549C3CD04CC9BD4AEF073CC3D9F1BD464FCC3A4B377B3DC38B183E37AA56BDE65710BE7901C5BD8DEBE0BDD3AD87BD598408BEF6EA14BE9945BF3C4EC677BAC887F5BCF48132BE0D672A3D26FB0CBDFF8F723C131EA83D413430BEDFC72DBE30A24FBC3FBF103DF12BC33C8C16D9BD1B0E25BE3370AA3B45CE04BD1AF825BDE4DB13BD12291ABE80F8AF3D2619173DA938C5BD8991DC3D7737673C7F64043EEF51F0BD9851CABDD7201DBEF53A6BBD3EF8C3BD848BEFBD5B790FBE238F01BE4F00F03D51B159BDD30F2F3E3842CDBD543368BD3EA1263ED540B53CAD4C2DBC1704E1BDA288A3BD18ADA3BDFE11A33BED5A423DB71F1EBE2B8400BE128D1C3E58CC22BDF758F6BDA7AFEF3D107E5BBD363A90BD3AF57E3C65580D3EC87BA13DAA4F45BDE818673DD9A127BD8FDF13BED8AB0CBD2C847F3DFDCA06BC752C853D9CF9FC3CD0D4D5BDB8BA303E17ED6E3C582033BEB75B03BEB2D3C5BC584605BEE9B3833C35D35A3D0E9B073B534A0F3E8E8332BEC5681B3E323C9F3DB8DE19BEEC3AFA3AD0D3953D9167B1BCB6BBCBBD9A365F3D65EE223E77F71BBE37EACF3D11DC173E29BC0A3EA47861BD9B79C93B7C61B03D6112143EC6BFD8BDC6ABC33D46951DBE8E04E7BDFD39F9BD2E0EAE3D404303BE4179BCBC542AF63D897CCFBCFE90C3BDB0121EBE3340FB3B773C0EBD2055CDBCAD0ABD3DB494263D68F7CBBD473202BE21F3DCBD3FDD1EBB97659A3DEDEB90BDDD71533DBCF6203ED08242BCFC04013E5EB70B3EF19824BE2943A5BD89B6E53CD0BE4D3D78AC78BCC44C393D59B34DBD79BEF93C8E10FCBDA189ADBD169CD6BD805DD13C48512DBECEEDCFBDCEDCCCBDD1416EBD107D05BEC22C22BE08729EBDA7DA413D9842243E3DFE28BE058B923B8385023DA2C7773CB5B43ABC21081EBE0E68CE3C4CA94C3D562F883DD07FBB3D11D0C63D7ECFBDBD71E4743C441192BD2CF592BD607B10BE0C8A123E3B55EDBD8B96E43D895FB73D3BF81CBEA48C2CBE56153B3D95CD113DE40F2CBC84D915BEF1F5F2BDC10E1D3E44F203BE7C5A64BD2D02613D7F4372BDDEF9B2BC38A0713D95160F3D6A3149BD4E78C0BD4F1A02BEA2E7A23DCBF566BD38A119BE4DAC403D230D1EBDC781BFBD954A21BE3E8428BEFC4311BE2D9103BD3178DCBD96F2DA3B904D10BEDC89FFBD1A77983C7DAFA53C3947563DAE05FC3D7B9A70BD765B183E3F48373DBDAEE43C7C80A8BD84F5943CFB963F3DD2A78C3D50DA713D6DF620BD8C61263C3D07A83DC487143E63B7863D724B773D4C1C1B3EA190323ECD67873D1768A63C6A6B003E8428243ED5C785BCEF94A03C1A9D2C3E3E62B3BD4EA8AE3D8F80C43DC4CC2E3E050FD63DF24CD63D4FD99D3D3AED803D7B2F75BD3448BFBB4E1A96BDA1CAF2BD569ADB3DF27D883C9A79823A3DB8323EE1D4CB3D3B2985BDAD31783D4723893D6FFEA5BD5774B53D71F91A3EB712183D48E94E3C556416BE6E20B93DBDC5193DDF718ABCEC100C3E14BF733D467C743D80E49FBD1BAE4EBD0F9AEC3DFC3AA33DBE0103BDA1E1E8BC29C90DBD7E5722BBC2BCB63D0B380EBE067F2BBE786436BCDCF555BD4C1F83BDEC440F3B9E5CBCBB93C02DBD329F053D956F9B3D5D0B9DBDA24EB33C9E2230BE73A101BEEA5B0D3E5F5F0B3D6A67EE3DD434EDBDDA48AB3DBBFA1E3E4EE6E63D8919AABC34F8E6BDB6963C3DDFF5833DCA75B33D8857773D50617D3D85048F3DDCCEC03D27CC7DBD9161F73DB858B7BDCBF3533D53D1D3BDB03B6BBC924F9E3D73E11CBEF35427BD782D093EBF8A53BCED6E463DF67D03BE72081FBD94FEB1BDB5020A3ECD0FDF3DF093D1BD09D1533D18DBC13D4A6E173D1107243E45C79E3DBEBF3CBD6C37C5BD9E9F1E3E5E0C583DFA580ABEF9B621BE2D4D6D3D2699363D8CA5A53BA18F833DA7DF063EE548D13DBAA5853D24B49B3CCAB6863D8135F9BDEB3CFD3DAD0E6F3DA59CDBBBECE0753DB036A7BDE5E27CBC3ADEFD3DA1A028BEBE2EA5BDD4391CBD5AC519BECF55733D05931B3E37BC193E54E11F3EEDF86B3DECEC9C3D00BB2BBE6E040FBE47BF4DBD28F4DABD6ECB203E394ECEBDA61FED3D6C0D053E6224123EC1EF203D43AE41BD424DEABD052886BD053620BECB8EF4BD2CBE063C306D33BE0544CDBCE4E797BD4D4AAFBD7670D9BCE1549B3D1D3094BD862E5DBDC59411BD8494B53D9A48953C6DDD913C2BBF923BFCBEC4BD9F34F73D30E1EABD078795BDFC012CBE7717ECBC1E54F53C4467113E1F576DBC6378013EA51BCE3C2FBB353DBF56C9BD3BC02EBE9A3A0BBD"
    }
  }
#-}
