module @module {
  func.func @main(%arg0: !torch.vtensor<[1,32,56,56],f32>) -> !torch.vtensor<[1,16,56,56],f32> attributes {torch.assume_strict_symbolic_shapes} {
    %0 = torch.vtensor.literal(dense_resource<torch_tensor_32_1_3_3_torch.float32> : tensor<32x1x3x3xf32>) : !torch.vtensor<[32,1,3,3],f32>
    %none = torch.constant.none
    %int1 = torch.constant.int 1
    %int1_0 = torch.constant.int 1
    %1 = torch.prim.ListConstruct %int1, %int1_0 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_1 = torch.constant.int 1
    %int1_2 = torch.constant.int 1
    %2 = torch.prim.ListConstruct %int1_1, %int1_2 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_3 = torch.constant.int 1
    %int1_4 = torch.constant.int 1
    %3 = torch.prim.ListConstruct %int1_3, %int1_4 : (!torch.int, !torch.int) -> !torch.list<int>
    %int32 = torch.constant.int 32
    %4 = torch.aten.conv2d %arg0, %0, %none, %1, %2, %3, %int32 : !torch.vtensor<[1,32,56,56],f32>, !torch.vtensor<[32,1,3,3],f32>, !torch.none, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.int -> !torch.vtensor<[1,32,56,56],f32>
    %5 = torch.aten.relu6 %4 : !torch.vtensor<[1,32,56,56],f32> -> !torch.vtensor<[1,32,56,56],f32>
    %6 = torch.vtensor.literal(dense_resource<torch_tensor_16_32_1_1_torch.float32> : tensor<16x32x1x1xf32>) : !torch.vtensor<[16,32,1,1],f32>
    %none_5 = torch.constant.none
    %int1_6 = torch.constant.int 1
    %int1_7 = torch.constant.int 1
    %7 = torch.prim.ListConstruct %int1_6, %int1_7 : (!torch.int, !torch.int) -> !torch.list<int>
    %int0 = torch.constant.int 0
    %int0_8 = torch.constant.int 0
    %8 = torch.prim.ListConstruct %int0, %int0_8 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_9 = torch.constant.int 1
    %int1_10 = torch.constant.int 1
    %9 = torch.prim.ListConstruct %int1_9, %int1_10 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_11 = torch.constant.int 1
    %10 = torch.aten.conv2d %5, %6, %none_5, %7, %8, %9, %int1_11 : !torch.vtensor<[1,32,56,56],f32>, !torch.vtensor<[16,32,1,1],f32>, !torch.none, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.int -> !torch.vtensor<[1,16,56,56],f32>
    return %10 : !torch.vtensor<[1,16,56,56],f32>
  }
}

{-#
  dialect_resources: {
    builtin: {
      torch_tensor_32_1_3_3_torch.float32: "0x0400000016E6BDBD06C3BBBD40B60C3E66F98DBE9E3137BEB095C53D545D823E9BD73F3E2044BD3D400DF5BDA03936BE7C5CA83E9889863E50DBC23D5440923E50F55D3E5619F43C40CDFCBC1B3F33BE26B33E3EEBA1A43DDB660ABEFBF01C3EDF3F813EFBB9893E4E748BBEE3AB9C3E006BAC3BDB6A7A3E405535BEE84E36BE77A69D3E5BE1B1BD5A85953EF3E09BBEB646603DBBEC383EF87F343EB3B878BE7BCBCD3DAE4B8B3E23AD903E968A6D3DD3F43D3E7A0B9ABE3665CC3DC8C28DBE007418BB3C01803E2B58073DBEA6513EE642923E0718913EBBF8D0BDD65FA8BD36D7623DB6E3B8BD86CE73BE26B5443E623AA0BE8BA685BD36D8073E139268BE637480BE3B67053ED3A110BEF30B023EE09003BEEB241A3E5E31653E40D3533DF052573EEE8A183EAB4278BC94D49A3E2B62F43DD89D52BED04E8B3EAB17A13ED84713BE969652BEC0E14C3D76DC5FBD56892B3BE8E69CBE56E399BBC03D92BDF34A09BED3CC3D3EF61307BE137416BE444CA8BEAE9480BE80D325BCC60B8E3DC76685BEEBFE44BE97D287BE307C383E44538A3E66BA91BE13C17EBE8BA04B3D26BA41BE9BA689BE3656163ED7AD9ABE3B5F41BE63F48FBEDF3D893E4085E4BDD64A68BC8B6B4E3DB0FE003E5B831F3EAB36613D104D10BE233D193EF0FCB03D48C2663E7BC42C3E2B9F893C40BE0BBE5881673EC6539ABE80C8EEBCCBAB2CBD288C65BEAB2672BB1375583E46B24C3EE61D7EBE5EC361BEE8B7A7BE73AB1D3E3BE58FBD2B5ABA3C102279BEC041763E7E209FBE93CC1B3E6016C03D02708EBE983D9A3E608492BEF8481DBEDB8A243E08BA3D3EAB29433D78E72ABE402599BC92988CBE361E27BE9018E0BDDC7E893EE389223EF00462BEEBC6A4BC80C226BDAB8270BE46ADA2BDCEA375BED3295EBE20B605BDC30174BE001E8FBBEE99873E78186EBEC3584C3E56EDA1BB10C58EBD2AD5A7BEA6099B3E0088B53DA6FC2D3E2349213E63862E3E667C98BEAE737EBE362B49BD1B8E173EBB20833D9618DBBD106F6FBE16B90F3E5EEB703E04E4A7BECE7F003E7E4B45BE8A0EA63E609D7A3D0E773CBE0B839ABDEB5B913C8E6EA0BED0C242BE93C3603E9B6BFC3DF0FAA4BD86E748BEF8BF4DBED6A2A93C560713BBAB72B03B5BAC74BEB3C50C3E00FABE3DDAC2A6BE26B4C5BD2B7911BD5A94813E102D6A3E76A7093E368BAABEB0BD3A3E935E10BE733D2DBE2058DB3DF4F982BEC8E491BE0E6448BED6B7E03CDBB2B7BDE8FF4EBE669CA8BEAB9A0ABBC6ECAFBD68A279BE7214913E7B203C3EA031ECBD5295873EAB6D1DBC5CCD83BE5680933DAB3B8FBE600C81BE7670163E73A97C3EAB28ED3D57FA843E9E5C543ECBC84CBD06FAF7BDD68A80BD86CD593ED02D4BBE90C59ABD8B73443EC8DB07BED8554EBE6BCCA73C46A614BE70D3D3BD142B8C3EC01F423D8C5B9DBEB83A303E703CBDBDEB4598BCF046F2BD3B99A6BE28E883BEC001E43D1BA2883E0EA8133E20A21BBE9694F33CC6C04BBE6BF994BED63A723E56903F3C1B6B19BED67397BE500447BE566CBC3C8227933EF84F4D3EC0A993BE28ED103E305507BED6336E3EC0DA083E003E0EBCA0084EBEDC359E3E288F62BE473584BE",
      torch_tensor_16_32_1_1_torch.float32: "0x0400000025D325BEA67DDCBDAF2CDABC84B5ADBD4F99D7BDE61FBF3CD824E63B668267BDB5F08CBDE1CBCABDAB1212BE73FDCD3D085FC33C4297523D1E2588BCA51D10BE524E27BE283A6CBDA02117BE8296563C5DF2143EAFFC00BE777850BDEF7769BDFA2C07BE82B9343D2D41973D5E7CDCBDB11C333C8B7002BD93A39EBC9656DDBC16C698BD32F0A23D5A5A013EACB5913DE9BD1CBE4C7F253EB9A4003D2E14B6BDF435013ED059073E5CCB4E3DBE1E273DE989D63D8C2EC83C3C00FCBD5B8DA4BD3A13FEBD1D7E49BD4FFEA3BD6A11DF3C4FDC343E3F85A0BD33BC0CBE434632BE0F6E17BEBD0D09BE67D209BE22B795BB0DFBE6BDB120C63D348F9BBDBC4581BDB9BC3FBD21EBC33C1411D5BD58A915BDF279BB3C9980FCBD55BBDC3CD9F571BB8FA6A43D0DD96DBDE0F9CCBDA09551BDC4A42B3CB84312BE3D8B38BD406C9CBD3414C0B961550CBE08FDADBD4A81A0BD7693A9BDCEA4043EB23D0BBCCAA7F7BD3CBB9DBDEA97A93DFEF33ABD8A7AE1BD3B36EF3C8C24043ECDAA693D26ECC43D5A23F9BD9DA8BBBD059AACBD2684273E7529133E7110F8BDA202FE3DCFC529BEC2E6C8BDD855123EC9310D3E95741CBE479D91BDBC4C913CBEB657BDABFF56BDE33C323E02B11FBEF5ED753BAAE0EF3D89AACC3D26A00A3E446AF6BD87FBBE3D11A38DBD6FC994BDFD5FAB3D818018BE8ADA2DBDC68FA2BD93ABBFBDA86E6DBD5AC552BD5A6048BC2DE5A73D829630BE64964A3DAB43183E927F0ABC9274F7BD7D71F2BD52B5953D7FC007BE061A54BD1BC7F6BD3EC308BE111DFDBDF75B3E3D9BF7143E8D53EB3D78CDFF3C3237C2BD4850253E60F52FBD9D4D9A3D888AC1BCCFE32B3D635C8DBD77B8C2BD2C6260BB4CF48ABD1B3ADF3DBB182B3EB186F63B64D2B4BC8D2B143D504B0ABE26F784BD19C1B2BD5A494C3D060781BDC50F20BECD7EFB3D6857A23DDA2A49BC5A7844BD3A49143E4B3CD6BD121CADBD9C8CA3BD985127BEA465E43D50E5E33DA1ED6C3D7BABD73DDF7D1F3DB59110BEF60C953D35CF013E626018BE2522C13DEB759E3C100126BEA891E73D57CA26BE73498D3D5329E5BD0FC76EBD4B7C873D5940263E5C49CF3D7C26DA3D9A5D2FBE379BAE3DD354C9BDD5ED41BD08C896BCE904B03DD32104BE76E8DF3CADC78CBD092898BB814A073E840EADBDE255D03D0664B93D1176EB3CDAF90EBE23C6653DDD8C26BE1E7A2B3DA794B0BD221643BD39ED1E3D135CF3BD9DE717BE20B525BEEF253FBDA1E7773DC0A5343E7957BD3DFC27DD3D76A897BD006239BD4661013E6D19343E620077BDD5A51B3EE63CC8BD8340853C7F67DC3D4710183EB81256BC2EC3A3BD2613FABC767F323ECA292D3EC8400CBE8858E1BD8614B83DC2E300BED588173EEFEBFA3D88E5F2BD954469BB2D1A10BE518F213E63E71A3DF8B535BDBF73BFBDD60E2B3EA2387DBD77A1C13DA26E013EC0C2053DD5C2A43D513613BC35D9083EE2BB3BBDBF2FF5BB9381293DA2EB3BBD636F8E3DA1BB2CBEAAD89BBD3BC728BE875CE6BCD7C4F4BCC14C723D47161BBBD78032BDB46ECFBDB86A213E974DD13C194F11BDE63EE3BD61D9373C9843DBBD3A6FF03DD517BF3D4B2F0BBEEF8E6E3D12049B3C04C507BEC38684BDF1D4D43D5F75D4BCE3D91CBE820FC2BD35D732BEED6402BE7ECEF13DBCBB703DFC437A3D05A7EA3B5A09C9BD21DE723DB40F32BEAA8F20BE87019D3D1F582B3E5DF54FBB671E42BD9B9D8DBDD57FDB3B07E8EC3D6B9DCABC76EDC5BC0FFB9BBD7C3BA6BD294EE73DC351E73D55D6123EAAF0053ED713EA3D43EA44BCB2A1DD3D11BCF4BDDB2442BCBF2B25BEEA770C3DB8CDA13D481519BE2A143FBD3EAC1F3EF3CC35BDC99782BCF21640BDC2984EBA33D0933C2DAA513C88E100BED1D439BDB7D518BECD57183E49CDD4BDE43E17BDA0BA033EA99ADA3DD3A9BCBC1CDE023E34A2F83DAAB62F3EE476FFBC9333B53C72631F3EC329023E727B893CCBC7033ECD6E103E6F73183E83D9073E747415BEE889C23D6A540A3D308FD73D1893103EC0FFADBDB23A0EBC8D927CBDDE0D0D3DDD32FFBD6B753A3C7F67473D2958163EBBC2003E007615BE57C4513DE6A20CBE8AF94F3D513FE6BD9C3FFEBD4A69073E7625CF3DD41CEB3DB944F63DB985303E11AF1BBEF5A7EE3DB78700BE6EED183D4935063E6F91AABDB9BFE8BD943308BED437FA3D73BE333EDC68E63C142C073E3027D5BDD141103EA3B5EC3B20352B3E234833BDB13BAFBC68A2313E161B0DBEC417153DF7A4EEBC7640EB3DE377CEBD3473133EB2AB343E4FA2CBBDC417613DABCB0F3D935EC2BD08E8253E380B3A3D72D3683D0277173E3AE4023E73EC9E3D092AB6BDBD200DBDE6361FBE299A0EBEF25AB2BC76C6A73D225F563D6E95C6BDBBDBA73D165C2B3EC499023E19CEBE3CCD4B12BEF6B31CBE573C2EBD6124D33D1EB5033EB84D033E93FF353D22994A3C1E2E80BD9AA1D13C7EF5E0BDCD3A78BC542C35BD2CF4DB3D7E040C3E54982EBE3EA8233EE86629BE1FB21B3EBBF3BBBDEEA9173D63D3C73D9C4BE93C23FD013EF4D1BCBCD194303EAD2BB7BD6B43743D293DB8BD7F3A383D0A422C3E847E193E846791BBAF5816BD09D07E3DA96210BE2F3AE5BD6E3B223D4F7C953DF8D2BEBD1526293EC2CBAA3DF2FFF7BD617A253E513D15BE2CC1D7BD4FAA1F3BA320DBBDCFAF1FBD121D61BDBB8910BE845E773D1AB7BCBDA6BD203E712D34BEFADD29BE201BF8BD66EEFCBDA95C04BE4CBC38BDFA891E3EFD8C08BE7ACF5E3C3562023E9904013E5D1B2D3E4E9F28BEC0B02ABEFBD500BED09521BD8EDAAE3D2DFEC1BD2A56FF3DD86241BC358A33BDF16CE73ABC6FE7BDC0BBFC3D4A4602BE66421C3D46F8E9BD"
    }
  }
#-}
