module @module {
  func.func @main(%arg0: !torch.vtensor<[1,32,56,56],f32>) -> !torch.vtensor<[1,16,56,56],f32> attributes {torch.assume_strict_symbolic_shapes} {
    %0 = torch.vtensor.literal(dense_resource<torch_tensor_32_1_3_3_torch.float32> : tensor<32x1x3x3xf32>) : !torch.vtensor<[32,1,3,3],f32>
    %none = torch.constant.none
    %int1 = torch.constant.int 1
    %int1_0 = torch.constant.int 1
    %1 = torch.prim.ListConstruct %int1, %int1_0 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_1 = torch.constant.int 1
    %int1_2 = torch.constant.int 1
    %2 = torch.prim.ListConstruct %int1_1, %int1_2 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_3 = torch.constant.int 1
    %int1_4 = torch.constant.int 1
    %3 = torch.prim.ListConstruct %int1_3, %int1_4 : (!torch.int, !torch.int) -> !torch.list<int>
    %int32 = torch.constant.int 32
    %4 = torch.aten.conv2d %arg0, %0, %none, %1, %2, %3, %int32 : !torch.vtensor<[1,32,56,56],f32>, !torch.vtensor<[32,1,3,3],f32>, !torch.none, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.int -> !torch.vtensor<[1,32,56,56],f32>
    %5 = torch.aten.relu6 %4 : !torch.vtensor<[1,32,56,56],f32> -> !torch.vtensor<[1,32,56,56],f32>
    %6 = torch.vtensor.literal(dense_resource<torch_tensor_16_32_1_1_torch.float32> : tensor<16x32x1x1xf32>) : !torch.vtensor<[16,32,1,1],f32>
    %none_5 = torch.constant.none
    %int1_6 = torch.constant.int 1
    %int1_7 = torch.constant.int 1
    %7 = torch.prim.ListConstruct %int1_6, %int1_7 : (!torch.int, !torch.int) -> !torch.list<int>
    %int0 = torch.constant.int 0
    %int0_8 = torch.constant.int 0
    %8 = torch.prim.ListConstruct %int0, %int0_8 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_9 = torch.constant.int 1
    %int1_10 = torch.constant.int 1
    %9 = torch.prim.ListConstruct %int1_9, %int1_10 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_11 = torch.constant.int 1
    %10 = torch.aten.conv2d %5, %6, %none_5, %7, %8, %9, %int1_11 : !torch.vtensor<[1,32,56,56],f32>, !torch.vtensor<[16,32,1,1],f32>, !torch.none, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.int -> !torch.vtensor<[1,16,56,56],f32>
    return %10 : !torch.vtensor<[1,16,56,56],f32>
  }
}

{-#
  dialect_resources: {
    builtin: {
      torch_tensor_32_1_3_3_torch.float32: "0x040000000B95D83D3645953E6B7F943C0BAF4A3E5EBC9BBE088E843EBF2DA8BE00F4ABBB36EABEBDFB87A53E863862BE08CD233EEF6486BE7F58893EFBDFE73D56F374BE3604C4BDE39E2D3E60C6993E4BF2573E6B4CBEBD836E293E56D3DBBCF0E266BE10E6873D40E4A43E8B927FBEF64FDABD50E2C6BDEF5AA63EE8D2913E584C37BE00E6093CE380723EF65E443D360BFFBDB8AC1F3E00EB3CBE962E803E8009C03D4E7CA4BE8B059E3EDB6A093E5B6FEBBD9603313E80769ABD12C38EBE93E7803E2BDCAC3DD7DD953E1608833EB69D6EBD40EC34BE4BA06CBEE659C9BD0608433E6B61793D2B8325BC9885673EBB85F0BD8009553DC6C43B3E4A0A9ABE16A6153DF367A9BED65C483E547D9C3E58731CBEC04E103D30479ABE50907F3E48873DBEC007963C2B3C6D3C0364623ED8E408BE2E20563ECBF13F3EC02D2F3D8E5F9C3ED80145BEEB22BBBC02EF84BE48A8783E50B512BECBDC34BD2B2560BE6B94A0BC2E25393E7714A1BE2B95B8BC3B6E08BE4B3F753D108CA1BDBB84A3BE8021A3BDD31487BE9B51C4BDCB33953D56AEDABC1B09413E3B4C3FBEDB5450BEC629103E8049923D1E7A0D3E808F9FBDDB01153E666DA23D588873BEA03C2C3DD670A93D10020A3ED6A634BE80206ABC6B94A03E00CA25BEB277823E382517BE2BAE55BD4BDE61BEB83250BEBB4689BE80AD54BC5F5FA7BE5BB430BE2B3010BDE6BE083EE6E28F3E5627CA3B4B0E5CBD36FD36BD4343843E2BC2E1BC28788EBED6A3C9BC035D393E8B3B183D6B076DBE6BB092BCEB6D963D6B26CA3C3B65E13D201381BDCBB0A4BEF28F9DBECE8E1CBE02E49F3E4030C6BCE04813BE20122F3ED0F948BEAB6D30BE00F245BD1473AABE4BCA25BE56183DBCA819923E96D120BD561706BEFB53B83DB6A5E9BDEBDD54BEBED41ABE56ABA0BBCB277DBD7E3635BE5678C8BDB6C8443D6000FEBDFB5C3ABE0B5FCD3D002B6CBC580208BE1E3190BE3652D83DE65DC03D0B4E993D8BFA713DD657273D806970BD2069843EEB78E7BD48EF703E77E99EBE2B5230BD80D9B1BDD68BE63C56646EBCF8027CBE0EFC143ECE155F3E4B971EBE474E90BE2ACA94BEA0AE9E3D88C74A3E80C25C3C1661723DCF69893ECB7AFEBD54C48B3E0605FFBDC04DD5BC00DB4F3CD6E4463D787A153EEB2337BD38255EBE7B008EBDAE0C7FBE824BA83E70C7FEBD2BD934BD43340D3EC6CD16BECB6E0BBE9E2D99BE0BC1533E38D329BE6030593D96C8B63C209D0A3E1376173EC64A6EBE23627BBE7B8F7C3EEB7B0FBDDE504F3E08EF55BEAB4EBFBA475C843E0EDF5FBE73925D3E50CE7E3E2461803E5E619B3ED800483EFE885CBE507CB23D701932BEFFEF953E163B0B3E03A71A3E2EB744BEB629B63DAEFC4C3EC0E6F3BDD050BDBD6687F13D368013BEA2EDA1BE10B6893E8E16053E2BE32DBC6B9449BD00547F3E40C7EA3DFC389A3E2E28883E6BB0F33DCB2D10BD366CA8BE5666C7BD00C64BBB00F1E9BC2BC1E5BC00FCD2BB9B89D63D9E582BBECBAF513DAB10153BA6017D3EF63C703D5EEC6FBE40B68D3E70A5053E407726BEA67488BDFEC98F3E6C4F933E58F3413E001601BE3AD08ABE3B43683ECB88373E50AC22BEAB254F3C",
      torch_tensor_16_32_1_1_torch.float32: "0x04000000714ECF3DC6517EBD28EDF0BDDEE3B9BDBCA428BD04C2013E8E0009BE862E343EF83526BE67F5D4BDDCA1183DC64DD83D5127EF3D73FA823D92B645BD3998643D0350FDBC0E69A33DA5ACB5BDA73A7B3DB2D7DABD6C5D983A9AFCA43D2A65DA3B411F89BC6EFA95BD84CAF9BD0239FBBD0804223DB57C3FBCDCD7583CEEBF143D10A200BE2A631A3E6C366CBD85CFD33D81CA10BE8A49913DDE8233BC7B76A73DC8BFF8BC044234BEA9E21A3E96608FBC9885A9BD29FA423DE871943DB6DB0C3E6C49CBBC15D2C3BDFDBAD63D8ED8453DB996D53DCE0908BD8289873C278A19BEBC462A3E68202ABD60A5933C63C93A3B677ABCBD7CCB2BBE67AE50BD03EA33BEA21BDB3D4793F4BD03742A3E2463B9BDC00923BD0F4F83BDF301FE3D2EDFECBDE27CC1BDC7C2433BD71A1E3E14D415BEB9CAB63DF304B53B138E283E92A4A83D5A78FABD46AE22BECDA0DB3C304593BD62E71F3DB9060EBC81190BBE6AD1F8BDADE0E7BDBD53DFBDBAAE123EB9EACB3DA3E37ABD464FF83D36E1A03C43F863BD0AF556BDFC4E1ABD3EF21E3E9D8698BCD6E32EBEE70266BC5BE1093DA44D033EAE80ECBDA9D5343E4039E43D18CB1F3ED68E14BECB19B4BD746E823D0667A3BAE10FC3BB96EC8C3DB8CBE4BD198E32BD732FF9BDBA3EDE3D39D9B13D5E70953DC3E2253EC566A9BC7FF94ABDE90C10BE10FE18BE2B7DA0BD3871323DF91BE63DFE722DBDF11532BED74FB2BDA2B5BA3DB2D2CC3D112EC3BDB91EFFBDFF258DBD709A233EEB50323EF2BC1B3EF47DDB3DC65FCDBD3C189BBD9B9C0B3E3573D8BD597FFE3DE3A8833DC3CED93D092DFABD56820FBE49ECACBDD8ABBEBC3AA8A43DBB07293D864470BD2C4658BD929010BE5ECDE6BD4589173E8D6C333EC9261BBECEA0A13D6988493D3D269CBD06DE303EEDA303BE9EF7EE3D226B813C76C7BD3D9C85D0BB88A92C3D9F42083E12EDF83D5036A0BBCE30FA3CC031F23DC61A06BE9FCF26BE68FB27BE76DAFD3D06122B3E1920373DFBF117BEBE0B163E368E4FBCAF54B13DB0B96F3DF59B53BD02FE63BB414D26BE32E04ABD9EC019BE48881F3E51B3873C9D7253BCFE61D8BCEFE4893CD1EDABBC2BE04BBC94B3D3BC1A56263EA10814BE39210E3E0CF2A1BD8528C73B0AC60EBD2B30063E2F6EE43DF973D53D14B3343EDC682E3EE7399E3A4683473D3F179EBD13EFB4BCA424C3BDF81C1D3E96F28A3D201FE33DFB08FFBC59341EBECF166FBCE66A84BD899F583D1CE58EBB34C4C9BD8A9704BEDD3694BC534B943C89AD0CBE2A7B4BBD9AD8273DB69D38BDAEB91E3E4AEF1D3E847C053EBEFCE03D115A243E565024BE0A2F00BEFDAE843DC56DD03D14171ABD7E852CBEDC5FFCBD884D3FBD48267F3DAF36473D5A63EF3BDC78B5BDC978DA3BFA57923CC3D722BE2E0CC93C449391BD72C9183E53F0AF3D2C22613D65642B3D911C25BE4C4D0FBE7BCE92BDB7E58C3D436E08BEEF42A8BDB006EB3DF2888F3D286D2F3EDD85203DFCDD9ABDF8E41FBEBB4B04BE2C4E97BD275D613D206F313BE846F53B3156D0BC6D8B543C68C5E7BD2EF051BDEB16D8BD953050BD44DB02BEC76ECD3DC99559BDD23E2CBE36CC0FBE43FB29BEB96DEE3C2E749FBD51C014BEEE86EB3DEB5611BEE882A83C408A72BC17CCE7BDB82DE1BD3AF6EE3D557ACEBD2BB321BE8A8FF93C1348B2BCC3DB5EBDB76F543D77382BBE17C2CE3D7A580FBD03ABCE3C3DF16B3D8ADE913D0873EDBD10B4253D9175913C22F317BE7E3175BD9A0F0B3D95B9243E9F888E3D049D1D3D8C3ABF3CEEEB2FBEF6172B3EF6ABE1BDEBAE98BD835777BD082AA83CF4C2223EE868BF3D563FA73DA35FCEBD52E1E0BD99EA083EDDD7D3BD1834B93D646105BDAC1EE7BCEF1E2E3E030EFCBCA53E5BBDB54A57BD8D909DBD3F6314BEC1B9233B0643413C839AEEBDAC71E03D36EC2CBE506F033E0C26983CEB2C8CBCF26F0EBE64B4CC3CF8BD0DBEFFC722BEF8A794BD5BF5803C2110C8BD0A27E0BDBBB0193EFB33E83DA6401BBE63EDFD3C9D8ABEBD3AA1813B92B55F3D6A75543C2E9829BEF7C63DBD74BEDB3DBB030D3E00AC2F3E94FE033E08C82E3E6AD6B83D9E8DE83BEFD3F23D9394323EBE1A8E3CF7620A3EED70C8BCBDF190BC6E6EA4BDAB3D533C9D86AB3D594512BD1E49B13BCA2429BE7747343D9DE2AFBB4AFB17BE6B08C6BDF27F9F3DB9309E3D76790ABEFEF250BDD74EEC3D4C5614BE5FBBAF3B2FCD23BEDADD17BEA686113DC247FB3C00E753BD7CD5C33D2C8055BC96511E3E589D7A3DDEA4953DA615B2BD840193BD772B0B3D42A5C53DC1071F3E14C8A6BCF239C03D26DA0E3E98C9E53D36042A3EBDE9A73D60475F3D6D31CB3B051E0EBE33510C3D263CF6BDDFD8613DDA3F2CBE6581083C2B505FB93716A33D8BAC66BD790DDCBCE59A903DAA79BC3DF1F3F6BC06762BBE8A472F3E3B9804BE0288E73D64CAFE3DE725EFBDC74D75BDFD29E73D858934BE267F013E8D3671BDB9858F3DFC32233EA6992BBE2DAD8FBC8973DBBDA48BC23D23BB29BD066CC1BD676C343E91860FBEE791263EED86F4BCF526D0BDF096F13D6B7DF9BAB1F9333E1A6830BDA3BA77BCA8D50F3E473AC23DA8D2563DA7E1CF3D8D2D873D1C9F6EBDF818633DDF67D23D05A9193E04C2673DEE89B33D8F7BE5BDC0B0293C930CE3BDAEFD9B3B1AF464BD2D13DE3D3F99783D41CC343E8299913DCBCB113ED0729A3D26637DBACBC5EBBCAC2BD5B9513EFC3CDC7F083E5C1BC1BD0EDF96BB259045BD35EB083E52F20A3DB0022EBD415D2D3E5805F73DD1C917BE35A933BD9FB4243D588FF63DA93211BC511419BEFB16313E7D4D36BC00D9A1BDD8EC7B3D20018DBD03EBEEBDA1FEE0BD425E473B92DA403D"
    }
  }
#-}
