module @module {
  func.func @main(%arg0: !torch.vtensor<[1,32,56,56],f32>) -> !torch.vtensor<[1,16,56,56],f32> attributes {torch.assume_strict_symbolic_shapes} {
    %0 = torch.vtensor.literal(dense_resource<torch_tensor_32_1_3_3_torch.float32> : tensor<32x1x3x3xf32>) : !torch.vtensor<[32,1,3,3],f32>
    %none = torch.constant.none
    %int1 = torch.constant.int 1
    %int1_0 = torch.constant.int 1
    %1 = torch.prim.ListConstruct %int1, %int1_0 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_1 = torch.constant.int 1
    %int1_2 = torch.constant.int 1
    %2 = torch.prim.ListConstruct %int1_1, %int1_2 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_3 = torch.constant.int 1
    %int1_4 = torch.constant.int 1
    %3 = torch.prim.ListConstruct %int1_3, %int1_4 : (!torch.int, !torch.int) -> !torch.list<int>
    %int32 = torch.constant.int 32
    %4 = torch.aten.conv2d %arg0, %0, %none, %1, %2, %3, %int32 : !torch.vtensor<[1,32,56,56],f32>, !torch.vtensor<[32,1,3,3],f32>, !torch.none, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.int -> !torch.vtensor<[1,32,56,56],f32>
    %5 = torch.aten.relu6 %4 : !torch.vtensor<[1,32,56,56],f32> -> !torch.vtensor<[1,32,56,56],f32>
    %6 = torch.vtensor.literal(dense_resource<torch_tensor_16_32_1_1_torch.float32> : tensor<16x32x1x1xf32>) : !torch.vtensor<[16,32,1,1],f32>
    %none_5 = torch.constant.none
    %int1_6 = torch.constant.int 1
    %int1_7 = torch.constant.int 1
    %7 = torch.prim.ListConstruct %int1_6, %int1_7 : (!torch.int, !torch.int) -> !torch.list<int>
    %int0 = torch.constant.int 0
    %int0_8 = torch.constant.int 0
    %8 = torch.prim.ListConstruct %int0, %int0_8 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_9 = torch.constant.int 1
    %int1_10 = torch.constant.int 1
    %9 = torch.prim.ListConstruct %int1_9, %int1_10 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_11 = torch.constant.int 1
    %10 = torch.aten.conv2d %5, %6, %none_5, %7, %8, %9, %int1_11 : !torch.vtensor<[1,32,56,56],f32>, !torch.vtensor<[16,32,1,1],f32>, !torch.none, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.int -> !torch.vtensor<[1,16,56,56],f32>
    return %10 : !torch.vtensor<[1,16,56,56],f32>
  }
}

{-#
  dialect_resources: {
    builtin: {
      torch_tensor_32_1_3_3_torch.float32: "0x040000006B8245BEAEE97C3EE8FC7B3ECEF12ABE100870BE5645C73BEC0098BE3E179CBE40C296BE28C17F3E1635A03E8CCB8ABE446F803ED6FDA9BDDB4E2F3E1F72A2BE485E04BE6033B0BD2B45863EA046FFBD10E1573EE320363E0347653EE0D404BEBF8881BE73E77DBE5BEF9FBEBBCF8DBDF00191BDA30D903E2B717DBC968649BD80E02D3C30912E3E86A2B9BD80C43BBD062B63BEF6AA5BBE731632BE6BC9C73C532400BEC8D25CBEF87938BE0B85613DD05954BEB30B60BED06A27BEB0180E3EB8709DBE38A7A8BE38EF743EE0F7323D804C8F3D80312F3E563E60BC76596ABE03CF9B3EC63B433E1A2597BEAB099E3E802353BE28BB723E76DE50BD20DB71BECEE276BE066C8EBDD695E33DD63743BCFB14953D40D9D43C988A023E5B1B7EBEC6EB813DE0B02F3DB8C585BE008E5DBEDB17A03D40C7A23E93844CBED6E1133E7EF9A3BEBCD09DBE96789B3CCB2C3ABDA0ADE93DA0EF913D7B97933EF46BA0BE9F1FA13E5B0DF73D4CEA82BE1074A03EE3C552BE683346BE2628073E580A6EBED6F11ABC0082F9BC9EAE68BE7B692FBE304D62BE786F563E6B94843D2E4413BE104A2FBEB67B2CBD4B28173EC82953BE708C0ABE58C56BBE4B915CBD00D089BDD61C14BED03F98BD56D0893E18A997BEC0BCC2BCA0F93DBDAB3A473C5B85D4BD46F9F13DEBB173BE9673D53DCE1F66BE1B91DEBDD6E165BE77EEA3BEEB1DAA3E00947CBB032823BEE8B7253E16B2E5BDB66EB7BD7E7D483EE3B456BE03777A3E5695303AA6740D3E7CA0973E08F2743E13FD613EBF17943E665EA4BE40873FBD16C4ACBD13B8423EB08694BE1CB19B3E4043C7BD38904DBE10258DBEC683A5BDD06044BE8BFF3FBE9072B53D0BA25D3ED0A612BEE03E16BEF03C9BBD58005BBE7AC6953E80EC3F3CF7989EBEC060F03C5E8175BEE80A123E869E9DBDEE01503ED3C80C3E90BB223E7640B0BD33F573BE2B40893E8B1AE33D5B2034BE0E38663EB6BB7DBEF3CA9D3E7641003ED61632BDEA59903E4085FABD5B31983EBFB3A4BEC8E297BEA0EB1A3E5BE1A6BE507DB53DFBE1233E807261BE8BEC453E03B57CBE330E5DBE2A309DBEA85B6FBE68F19B3E13331FBEA893973E662A2ABE267F59BE4B76C83D887B87BE069605BE08FB343EB698173D5ED8993E16902DBD169671BD96C9543D2B38343D5859813E80925B3E901D90BD70545CBE565984BBCCB1963ECE67433E0079D63DAE9077BE0BBC183E7BB0553E0B931FBEB72A9F3E06A8A83D129E8B3E0079F83D00E45FBD4E6E373EF0A9943D80E08A3C78EC2E3EE0723BBE8B5EE53D960ADA3C565531B7BB9204BE3B7FC43DF02492BE7B9A65BEB3D126BE88D42BBE6B24D23DD6DA69BD58D804BEAB24523BC612F1BD701C4D3EC6B9BEBD2024673DEB3B6E3D2CED9BBEF0007FBE1685BA3CB6AEAABD4F54813E867AEEBD76AA36BDD058CD3D38B69E3ED0C78C3EC025EB3D0292A0BE1B5D5FBE56B69DBB06F6493EA3866E3EEB229ABD68B59FBEF753A93E339704BE263CBABDE32F26BE468C8EBE0027A4BBBB3832BE98F5A9BEEBC63A3E68AC223E862050BEF3F670BEAB00E9BB93898CBE7EF752BE7B4C68BE58E80A3EBEC94D3E004B33BE602317BE",
      torch_tensor_16_32_1_1_torch.float32: "0x040000005751823D4B399FBD2E442F3EB583AB3CA2CDF9BD73A028BDE586D23DDDF6643D5D1CCC3B62F026BC8BA4BCBDBD129CBD87BEB6BDA0640DBED9B823BE704B343E48A697BD2293723D29FF1FBCFED7193C47EE4D3D3BE7383D763368BD8006063C791306BE9796463DD66AE83D047DB93DA092A6BD6C1407BE0248E0BC885575BD29D10F3E347FAC3DFE7D4B3D1EE32C3DEF9F3A3D5E73313D0CDB233E342E173EEA5A11BE481799BD1B2173BDB679B5BD7480A8BD55AE14BE5F7496BD509DDE3D705ABA3DA55C123E5A9609BEB8E22CBD96D905BEFE84F43DD3AA82BD8124B33D50CE32BDC4053E3B1F9E4FBC631514BE7911433C9A1FBFBD916D29BE0B90AABDE2567D3DA4526CBD21188F3DF36A243DF00ADF3D62DA183D25A150BDB356543DAE4BC63CEBB48DBD9C2CD33B04A08B3D09194E3C74AFE13D94FEE83A52320BBE7C83173E823752BD1EE9A1BD2CB3A03D2295133D8C35A7BCA877BD3DE068013EF8367EBD9FA209BEDC16323E736ED73D9CA4923C6BB4B6BD4D4EC63D444EBE3D72BFF73D3A27C13D23CE5CBD8B3DEF3DCD1229BCAA6613BC84980DBED3DB2CBE7A5A0B3EA66890BD8347C9BDC43BAE3BEAC195BCFA16643DB68AE2BD0F87B5BDB8671E3E3D8502BE9FE609BEDF2FD5BCDF21293E6BF0193E9F01B1BDFC1709BD42554D3B2667053E469DAD3D5E2AE03DBAEA5DBD5159B73D414F84BD4ADE343EB930B1BC1C9D12BE597B933D7C78113DA62D03BC8BB133BE7258D2BD5EE7143EC1898BBC1E522FBEA8E8ADBD7656AB3DA925E23C5390833DCBAF323EAAE709BED83AC63DB6C317BEA7E8003E119F173EA1646C3DB19FEA3D8A1A783C29E9B2BDEF859D3D71A6C03C6BD61D3EBBA805BED629A93D2E532CBE5D39CABCAF4A3A3D3CDEA3BDB463B5BCC379273E45A0F6BDFD95073EC06717BD7D937EBDDDD9983D16982D3E9450543D72DE0FBE15327F3D8F9615BD77AA00BE7C7D0C3EC0BF19BD859A293E632B85BDF12C2DBC548B10BE107A183B74B12F3EC5E71ABE598844BD342EDB3CF928903D793DB5BCC311A73DE68B97BC8E1991BD8717A5BDE20DD1BDDBC19EBD02BBE33C2CE3193DD750873DBD2194BCA77E163ECD8A2CBECA551E3DE0940EBDDB4D29BED267E8BD97E11FBEC43F8A3DA6FBA1BDB862CC3B6A2CDB3D568CC6BC8C811A3EC5D7AEBD23F5C3BDBC0636BD9F061DBD2405BBBCB880F13D0D1E193EE5D90ABE2962E4BDEE95E73DD8DA75BDBD0586BDCEA486BBE47331BEEB33FE3C383F8FBC5DC7AA3D27120D3DE689CE3D42972C3D6962ACBD9AB6D23D91D8EDBCEB2F9E3D5C4F893D2DF90EBE3AA1163E589312BE6D06A13C0149BABC319B9DBDBF9BF5BDFBA521BE86A048BCE6BB81BD92AFE63CCB798ABD87012B3ED071C13D03E9DB370661F5BC7692063E2DCE9EBCF2C39ABCE6DF87BD5024923D1AB532BC5CF38ABB39320EBEDB951DBCC3938F3C1ED4233EC6EC13BED00C853DB5B1DABBDD13F23D42A01A3E3B641B3EF11DF0BC253416BE09DF1EBE3BA0203E42339F3DAC7708BEF022A63D4A027E3D0FD10D3ED1D261BD866018BEA22C7DBD434FCEBDA46936BDAA2F67BDED268039FA49BEBDA48843BDD555243EA3DE6EBDD3A22EBC37BA843D99499DBD3ACCBA3D5DF0D23D4F132BBEAAE16EBDD1FE303EF29076BD676974BD06F030BD318900BDE9F3093E9DBF05BE3571DA3DFD6D25BE91BA17BEEC2B363D910235BEEA5323BEF1CB1CBEB65C69BCD282DE3DC597C23DEAD3AA3D9113763D29D022BEB0B61DBED808EFBDC728033E6B54FFBDD61E4CBC5A8ED8BD9227E0BD7D7589BDA7443A3D80311B3BF225BABD56724D3C7B6F393DC1065CBD9A410C3DBE315FBD616A3D3CB587C83D0BD2AFBDA04406BEE62B8ABDE28326BE91B3E03DC024863D6A9BCFBDB5FA21BD184CBFBD164B8BBC0EE700BEBC9C243C4A0611BB72C96E3DE38216BE0510083E4FDAF2BD39040FBB16500FBEA3D7FE3DBDF77F3D2907CEBD186A49BD66A92CBD9E9DFDBCDD04E7BCAD5F2D3956F99D3D06E5EA3D59EDEBBC3F6A0A3DC3CF0A3E5223E6BD1339DDBD38D810BE5298923DFAFE18BD5F3534BDA31E89BC169F6ABDF01C2A3BC96EAABBB6D430BC49FA503C049DF5BD43D0D33CD9CB45BD1A75E6BC22CCBD3C3688E0BD271B13BE365DA9BDDBB861BC098B143E2DCB82BD935C893D3821C03D422193BDD5D6B2BDD7F02C3C2B3806BE019DB4BC6BBED13D2D98B6BB6F01F03D753931BE7D53E2BD02DFC13D104F083EC408B63C393B9D3D162FBE3CA83EBDBDF5BAD8BC792DC6BD7E70293D95B018BE6C7CAC3D2FD502BE9E379A3D2AAB083E231702BC8613F2BDD8C0E3BC7B5796BD17CE233E0E472EBEEC9F77BD113F863D7F2A993D850C913D79C696BDCC3F28BEEB742FBEBD10613DD098B5BDAE27E93CEE42D3BCC620B2BD210F6DBD19370D3EBA1626BDDCAD70BD44A3E5BDB04908BDFBEFC0BDDA4E33BD0D8769BD9718BC3DF42D84BD7AB38ABD6EEBA7BD897BD43D30660C3ED84122BEEE37D6BCF732893D33963C3D677EFFBC4CBDD6BD846457BD8D65DEBD723A24BCD9959A3DD0463FBD26AD53BDD5658B3DA66C96BD8EFD2D3E8FA9E63CBDA374BCDBC20A3E6F6B1D3E3B8013BDF20F69BD8277A9BDCCA3883D8F4C033ED91B943DF8ADB7BDB8131FBEE9C8803D7898043E23E1F63D2EF896BD0ADDAEBDF6F8D6BD626A15BE02D70C3E5A5D023E2AB017BEB3C405BEE6473E3DE0AC893DAD59FB3D035D34BE5077F2BD5DE6113E80A9B6BC3D87ACBD0FDA18BE62387ABD19B382BCB34AB33C56C5B5BD03D4E73D0E6620BEEBBD08BE1511A2BD1ADDD7BD1838A6BBC6E003BE96C72FBECE0FCB3DD76FE83DAB2B0CBE20E4C93DF82973BCC2B0C93B"
    }
  }
#-}
